In [26]:
import pandas as pd
from datetime import date

In [3]:
df=pd.read_csv(r"C:\Banking_project\customers.csv")

In [4]:
df

,customer_id,first_name,last_name,gender,dob,city,state,occupation,account_open_date,account_type,balance,credit_score,loan_status
0,1,Anay,Shanker,O,1998-04-12,Delhi,Himachal Pradesh,Engineer,2017-08-28,Salary,187895.52,570,Closed
1,2,Hiran,Shan,M,1971-06-06,Bangalore,Bihar,Retired,2019-07-24,Savings,366264.98,320,Active
2,3,Dhruv,Rajagopal,O,2000-10-24,Kolkata,Maharashtra,Engineer,2025-01-15,Savings,78853.30,766,Active
3,4,Divij,Chopra,M,1956-12-04,Hyderabad,Haryana,Student,2016-04-09,Savings,50887.48,758,Closed
4,5,Jhanvi,Chaudhary,O,1989-02-25,Kolkata,Tamil Nadu,Doctor,2016-03-19,Fixed Deposit,433221.90,399,Defaulted
...,...,...,...,...,...,...,...,...,...,...,...,...,...
4995,4996,Khushi,Goel,O,1972-12-10,Bangalore,Haryana,Doctor,2016-07-01,Savings,472528.76,594,Defaulted
4996,4997,Pranay,Zachariah,M,2003-04-24,Ahmedabad,Uttar Pradesh,Retired,2017-10-08,Savings,321196.18,817,No Loan
4997,4998,Aarna,Bhalla,F,1960-10-13,Chennai,Kerala,Teacher,2025-08-25,Salary,280560.49,335,Defaulted
4998,4999,Bhamini,Yogi,F,1983-10-31,Mumbai,Nagaland,Other,2016-07-06,Current,132012.56,532,Closed
4999,5000,Jayesh,Kohli,M,1998-06-23,Ahmedabad,Jharkhand,Other,2019-12-26,Savings,300526.26,796,Defaulted

In [47]:
df.shape

(5000, 16)

In [49]:
df.columns

Index(['customer_id', 'first_name', 'last_name', 'full_name', 'gender', 'dob',
       'age', 'city', 'state', 'occupation', 'account_type',
       'account_open_date', 'account_age', 'balance', 'credit_score',
       'loan_status'],
      dtype='object')

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5000 entries, 0 to 4999
Data columns (total 13 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   customer_id        5000 non-null   int64
 1   first_name         5000 non-null   object
 2   last_name          5000 non-null   object
 3   gender             5000 non-null   object
 4   dob                5000 non-null   object
 5   city               5000 non-null   object
 6   state              5000 non-null   object
 7   occupation         5000 non-null   object
 8   account_open_date  5000 non-null   object
 9   account_type       5000 non-null   object
 10  balance            5000 non-null   float64
 11  credit_score       5000 non-null   int64
 12  loan_status        5000 non-null   object
dtypes: float64(1), int64(2), object(10)
memory usage: 507.9+ KB

In [9]:
df.describe(include='all')

,customer_id,first_name,last_name,gender,dob,city,state,occupation,account_open_date,account_type,balance,credit_score,loan_status
count,5000.000000,5000,5000,5000,5000,5000,5000,5000,5000,5000,5000.000000,5000.000000,5000
unique,NaN,208,450,3,4386,8,28,7,2725,4,NaN,NaN,4
top,NaN,Raghav,Lad,M,2001-03-05,Bangalore,Manipur,Doctor,2022-01-11,Savings,NaN,NaN,No Loan
freq,NaN,42,32,1715,4,673,199,742,7,1280,NaN,NaN,1270
mean,2500.500000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,247882.726246,575.103600,NaN
std,1443.520003,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,144085.116255,159.423828,NaN
min,1.000000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1026.360000,300.000000,NaN
25%,1250.750000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,122512.992500,436.000000,NaN
50%,2500.500000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,250217.985000,573.000000,NaN
75%,3750.250000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,372213.817500,714.000000,NaN
max,5000.000000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,499924.770000,850.000000,NaN

In [10]:
df.head()

,customer_id,first_name,last_name,gender,dob,city,state,occupation,account_open_date,account_type,balance,credit_score,loan_status
0,1,Anay,Shanker,O,1998-04-12,Delhi,Himachal Pradesh,Engineer,2017-08-28,Salary,187895.52,570,Closed
1,2,Hiran,Shan,M,1971-06-06,Bangalore,Bihar,Retired,2019-07-24,Savings,366264.98,320,Active
2,3,Dhruv,Rajagopal,O,2000-10-24,Kolkata,Maharashtra,Engineer,2025-01-15,Savings,78853.30,766,Active
3,4,Divij,Chopra,M,1956-12-04,Hyderabad,Haryana,Student,2016-04-09,Savings,50887.48,758,Closed
4,5,Jhanvi,Chaudhary,O,1989-02-25,Kolkata,Tamil Nadu,Doctor,2016-03-19,Fixed Deposit,433221.90,399,Defaulted

In [51]:
df.isnull().sum()

customer_id          0
first_name           0
last_name            0
full_name            0
gender               0
dob                  0
age                  0
city                 0
state                0
occupation           0
account_type         0
account_open_date    0
account_age          0
balance              0
credit_score         0
loan_status          0
dtype: int64

In [11]:
df.dtypes

customer_id            int64
first_name            object
last_name             object
gender                object
dob                   object
city                  object
state                 object
occupation            object
account_open_date     object
account_type          object
balance              float64
credit_score           int64
loan_status           object
dtype: object

# converting the datatypes

In [15]:
df['dob']=pd.to_datetime(df['dob'],errors='coerce')
df['account_open_date']=pd.to_datetime(df['account_open_date'],errors='coerce')

In [16]:
df.dtypes

customer_id                   int64
first_name                   object
last_name                    object
gender                       object
dob                  datetime64[ns]
city                         object
state                        object
occupation                   object
account_open_date    datetime64[ns]
account_type                 object
balance                     float64
credit_score                  int64
loan_status                  object
dtype: object

# standardize the gender values

In [17]:
df['gender']=df['gender'].replace({'M':"Male","F":"Female","O":"Others"})

In [18]:
df

,customer_id,first_name,last_name,gender,dob,city,state,occupation,account_open_date,account_type,balance,credit_score,loan_status
0,1,Anay,Shanker,Others,1998-04-12,Delhi,Himachal Pradesh,Engineer,2017-08-28,Salary,187895.52,570,Closed
1,2,Hiran,Shan,Male,1971-06-06,Bangalore,Bihar,Retired,2019-07-24,Savings,366264.98,320,Active
2,3,Dhruv,Rajagopal,Others,2000-10-24,Kolkata,Maharashtra,Engineer,2025-01-15,Savings,78853.30,766,Active
3,4,Divij,Chopra,Male,1956-12-04,Hyderabad,Haryana,Student,2016-04-09,Savings,50887.48,758,Closed
4,5,Jhanvi,Chaudhary,Others,1989-02-25,Kolkata,Tamil Nadu,Doctor,2016-03-19,Fixed Deposit,433221.90,399,Defaulted
...,...,...,...,...,...,...,...,...,...,...,...,...,...
4995,4996,Khushi,Goel,Others,1972-12-10,Bangalore,Haryana,Doctor,2016-07-01,Savings,472528.76,594,Defaulted
4996,4997,Pranay,Zachariah,Male,2003-04-24,Ahmedabad,Uttar Pradesh,Retired,2017-10-08,Savings,321196.18,817,No Loan
4997,4998,Aarna,Bhalla,Female,1960-10-13,Chennai,Kerala,Teacher,2025-08-25,Salary,280560.49,335,Defaulted
4998,4999,Bhamini,Yogi,Female,1983-10-31,Mumbai,Nagaland,Other,2016-07-06,Current,132012.56,532,Closed
4999,5000,Jayesh,Kohli,Male,1998-06-23,Ahmedabad,Jharkhand,Other,2019-12-26,Savings,300526.26,796,Defaulted

# Clean and Normalize Text Columns

In [19]:
for col in ['city','state','occupation','account_type','loan_status']:
    df[col]=df[col].str.strip().str.title()

In [20]:
df

,customer_id,first_name,last_name,gender,dob,city,state,occupation,account_open_date,account_type,balance,credit_score,loan_status
0,1,Anay,Shanker,Others,1998-04-12,Delhi,Himachal Pradesh,Engineer,2017-08-28,Salary,187895.52,570,Closed
1,2,Hiran,Shan,Male,1971-06-06,Bangalore,Bihar,Retired,2019-07-24,Savings,366264.98,320,Active
2,3,Dhruv,Rajagopal,Others,2000-10-24,Kolkata,Maharashtra,Engineer,2025-01-15,Savings,78853.30,766,Active
3,4,Divij,Chopra,Male,1956-12-04,Hyderabad,Haryana,Student,2016-04-09,Savings,50887.48,758,Closed
4,5,Jhanvi,Chaudhary,Others,1989-02-25,Kolkata,Tamil Nadu,Doctor,2016-03-19,Fixed Deposit,433221.90,399,Defaulted
...,...,...,...,...,...,...,...,...,...,...,...,...,...
4995,4996,Khushi,Goel,Others,1972-12-10,Bangalore,Haryana,Doctor,2016-07-01,Savings,472528.76,594,Defaulted
4996,4997,Pranay,Zachariah,Male,2003-04-24,Ahmedabad,Uttar Pradesh,Retired,2017-10-08,Savings,321196.18,817,No Loan
4997,4998,Aarna,Bhalla,Female,1960-10-13,Chennai,Kerala,Teacher,2025-08-25,Salary,280560.49,335,Defaulted
4998,4999,Bhamini,Yogi,Female,1983-10-31,Mumbai,Nagaland,Other,2016-07-06,Current,132012.56,532,Closed
4999,5000,Jayesh,Kohli,Male,1998-06-23,Ahmedabad,Jharkhand,Other,2019-12-26,Savings,300526.26,796,Defaulted

# validate Logical data

In [29]:
df=df[df['dob']<df['account_open_date']]
df=df[df['balance']>=0]
df=df[(df['credit_score']>=300)&(df['credit_score']<=850)]

# adding Columns

In [39]:
df['age']=(pd.Timestamp('today')-df['dob']).dt.days//365
df['account_age']=(pd.Timestamp('today')-df['account_open_date']).dt.days//365
df['full_name']=df['first_name']+" "+df['last_name']
df

,customer_id,first_name,last_name,gender,dob,city,state,occupation,account_open_date,account_type,balance,credit_score,loan_status,age,account_age,full_name
0,1,Anay,Shanker,Others,1998-04-12,Delhi,Himachal Pradesh,Engineer,2017-08-28,Salary,187895.52,570,Closed,27,8,Anay Shanker
1,2,Hiran,Shan,Male,1971-06-06,Bangalore,Bihar,Retired,2019-07-24,Savings,366264.98,320,Active,54,6,Hiran Shan
2,3,Dhruv,Rajagopal,Others,2000-10-24,Kolkata,Maharashtra,Engineer,2025-01-15,Savings,78853.30,766,Active,25,0,Dhruv Rajagopal
3,4,Divij,Chopra,Male,1956-12-04,Hyderabad,Haryana,Student,2016-04-09,Savings,50887.48,758,Closed,68,9,Divij Chopra
4,5,Jhanvi,Chaudhary,Others,1989-02-25,Kolkata,Tamil Nadu,Doctor,2016-03-19,Fixed Deposit,433221.90,399,Defaulted,36,9,Jhanvi Chaudhary
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
4995,4996,Khushi,Goel,Others,1972-12-10,Bangalore,Haryana,Doctor,2016-07-01,Savings,472528.76,594,Defaulted,52,9,Khushi Goel
4996,4997,Pranay,Zachariah,Male,2003-04-24,Ahmedabad,Uttar Pradesh,Retired,2017-10-08,Savings,321196.18,817,No Loan,22,8,Pranay Zachariah
4997,4998,Aarna,Bhalla,Female,1960-10-13,Chennai,Kerala,Teacher,2025-08-25,Salary,280560.49,335,Defaulted,65,0,Aarna Bhalla
4998,4999,Bhamini,Yogi,Female,1983-10-31,Mumbai,Nagaland,Other,2016-07-06,Current,132012.56,532,Closed,41,9,Bhamini Yogi
4999,5000,Jayesh,Kohli,Male,1998-06-23,Ahmedabad,Jharkhand,Other,2019-12-26,Savings,300526.26,796,Defaulted,27,5,Jayesh Kohli

# Reorder and Rename Columns

In [40]:
df = df[['customer_id', 'first_name', 'last_name', 'full_name', 
         'gender', 'dob', 'age', 'city', 'state', 'occupation', 'account_type',
         'account_open_date', 'account_age', 'balance',
         'credit_score', 'loan_status']]

In [41]:
df

,customer_id,first_name,last_name,full_name,gender,dob,age,city,state,occupation,account_type,account_open_date,account_age,balance,credit_score,loan_status
0,1,Anay,Shanker,Anay Shanker,Others,1998-04-12,27,Delhi,Himachal Pradesh,Engineer,Salary,2017-08-28,8,187895.52,570,Closed
1,2,Hiran,Shan,Hiran Shan,Male,1971-06-06,54,Bangalore,Bihar,Retired,Savings,2019-07-24,6,366264.98,320,Active
2,3,Dhruv,Rajagopal,Dhruv Rajagopal,Others,2000-10-24,25,Kolkata,Maharashtra,Engineer,Savings,2025-01-15,0,78853.30,766,Active
3,4,Divij,Chopra,Divij Chopra,Male,1956-12-04,68,Hyderabad,Haryana,Student,Savings,2016-04-09,9,50887.48,758,Closed
4,5,Jhanvi,Chaudhary,Jhanvi Chaudhary,Others,1989-02-25,36,Kolkata,Tamil Nadu,Doctor,Fixed Deposit,2016-03-19,9,433221.90,399,Defaulted
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
4995,4996,Khushi,Goel,Khushi Goel,Others,1972-12-10,52,Bangalore,Haryana,Doctor,Savings,2016-07-01,9,472528.76,594,Defaulted
4996,4997,Pranay,Zachariah,Pranay Zachariah,Male,2003-04-24,22,Ahmedabad,Uttar Pradesh,Retired,Savings,2017-10-08,8,321196.18,817,No Loan
4997,4998,Aarna,Bhalla,Aarna Bhalla,Female,1960-10-13,65,Chennai,Kerala,Teacher,Salary,2025-08-25,0,280560.49,335,Defaulted
4998,4999,Bhamini,Yogi,Bhamini Yogi,Female,1983-10-31,41,Mumbai,Nagaland,Other,Current,2016-07-06,9,132012.56,532,Closed
4999,5000,Jayesh,Kohli,Jayesh Kohli,Male,1998-06-23,27,Ahmedabad,Jharkhand,Other,Savings,2019-12-26,5,300526.26,796,Defaulted

# Ensure column Nmaing Consistency

In [42]:
df.columns = df.columns.str.strip().str.lower().str.replace(' ', '_')

In [43]:
df

,customer_id,first_name,last_name,full_name,gender,dob,age,city,state,occupation,account_type,account_open_date,account_age,balance,credit_score,loan_status
0,1,Anay,Shanker,Anay Shanker,Others,1998-04-12,27,Delhi,Himachal Pradesh,Engineer,Salary,2017-08-28,8,187895.52,570,Closed
1,2,Hiran,Shan,Hiran Shan,Male,1971-06-06,54,Bangalore,Bihar,Retired,Savings,2019-07-24,6,366264.98,320,Active
2,3,Dhruv,Rajagopal,Dhruv Rajagopal,Others,2000-10-24,25,Kolkata,Maharashtra,Engineer,Savings,2025-01-15,0,78853.30,766,Active
3,4,Divij,Chopra,Divij Chopra,Male,1956-12-04,68,Hyderabad,Haryana,Student,Savings,2016-04-09,9,50887.48,758,Closed
4,5,Jhanvi,Chaudhary,Jhanvi Chaudhary,Others,1989-02-25,36,Kolkata,Tamil Nadu,Doctor,Fixed Deposit,2016-03-19,9,433221.90,399,Defaulted
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
4995,4996,Khushi,Goel,Khushi Goel,Others,1972-12-10,52,Bangalore,Haryana,Doctor,Savings,2016-07-01,9,472528.76,594,Defaulted
4996,4997,Pranay,Zachariah,Pranay Zachariah,Male,2003-04-24,22,Ahmedabad,Uttar Pradesh,Retired,Savings,2017-10-08,8,321196.18,817,No Loan
4997,4998,Aarna,Bhalla,Aarna Bhalla,Female,1960-10-13,65,Chennai,Kerala,Teacher,Salary,2025-08-25,0,280560.49,335,Defaulted
4998,4999,Bhamini,Yogi,Bhamini Yogi,Female,1983-10-31,41,Mumbai,Nagaland,Other,Current,2016-07-06,9,132012.56,532,Closed
4999,5000,Jayesh,Kohli,Jayesh Kohli,Male,1998-06-23,27,Ahmedabad,Jharkhand,Other,Savings,2019-12-26,5,300526.26,796,Defaulted

# Exporting the Cleaned dataset

In [44]:
df.to_csv("C:\Banking_project\cleaned_customers.csv",index=False)